node {
  name: "module/hub_input/images"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "module/hub_input/Mul/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "module/hub_input/Mul"
  op: "Mul"
  input: "module/hub_input/images"
  input: "module/hub_input/Mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/hub_input/Sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "module/hub_input/Sub"
  op: "Sub"
  input: "module/hub_input/Mul"
  input: "module/hub_input/Sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/input"
  op: "Identity"
  input: "module/hub_input/Sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09000000357627869
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal"
  op: "Add"
  input: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/mul"
  input: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/Conv/weights"
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/Conv/weights"
}
node {
  name: "module/MobilenetV2/Conv/weights/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/Conv/weights"
  input: "module/MobilenetV2/Conv/weights/Initializer/truncated_normal"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.9999998989515007e-05
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer/scale"
  input: "module/MobilenetV2/Conv/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/Conv2D"
  op: "Conv2D"
  input: "module/MobilenetV2/input"
  input: "module/MobilenetV2/Conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/Conv/BatchNorm/gamma"
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/Conv/BatchNorm/gamma"
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/gamma"
  input: "module/MobilenetV2/Conv/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/gamma"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/Conv/BatchNorm/beta"
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/Conv/BatchNorm/beta"
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/beta"
  input: "module/MobilenetV2/Conv/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/Conv/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_mean"
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_mean"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/Conv/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_variance"
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_variance"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "module/MobilenetV2/Conv/Conv2D"
  input: "module/MobilenetV2/Conv/BatchNorm/ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/ReadVariableOp_1"
  input: "module/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/ReadVariableOp"
  input: "module/MobilenetV2/Conv/BatchNorm/FusedBatchNorm/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.996999979019165
      }
    }
  }
}
node {
  name: "module/MobilenetV2/Conv/Relu6"
  op: "Relu6"
  input: "module/MobilenetV2/Conv/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/input"
  op: "Identity"
  input: "module/MobilenetV2/Conv/Relu6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09000000357627869
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal"
  op: "Add"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mul"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "module/MobilenetV2/expanded_conv/input"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "module/MobilenetV2/expanded_conv/depthwise/depthwise"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.996999979019165
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise/Relu6"
  op: "Relu6"
  input: "module/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/depthwise_output"
  op: "Identity"
  input: "module/MobilenetV2/expanded_conv/depthwise/Relu6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09000000357627869
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal"
  op: "Add"
  input: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mul"
  input: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/project/weights"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/project/weights"
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/weights"
  input: "module/MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/weights"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 3.9999998989515007e-05
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer/L2Loss/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer/scale"
  input: "module/MobilenetV2/expanded_conv/project/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/Conv2D"
  op: "Conv2D"
  input: "module/MobilenetV2/expanded_conv/depthwise_output"
  input: "module/MobilenetV2/expanded_conv/project/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
    }
  }
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
}
node {
  name: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
  input: "module/MobilenetV2/expanded_conv/project/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@module/MobilenetV2/expanded_conv/project/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
